Revit 2024 API
RebarCoupler.CouplerLinkTwoBars Method
 returns true if the coupler sits on two rebar and false otherwise
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool CouplerLinkTwoBars()
Visual Basic
Public Function CouplerLinkTwoBars As Boolean
Visual C++
public:
bool CouplerLinkTwoBars()
See Also
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace